1.列举你了解的编码及他们之间的区别？
2.列举你了解的Python2和Python3的区别？
3.你了解的python都有那些数据类型？
4.补充代码，实现以下功能。

1.value =  _____
2.print(value)  # 要求输出  51devops"niubi

5.用print打印出下面内容：

1文能提笔安天下,
2武能上⻢定乾坤.
3心存谋略何人胜,
4古今英雄唯是君。

6.变量名的命名规范和建议？
7.如下那个变量名是正确的？

1 name = '51devops'
2 _ = 'echo'
3 _9 = "zhangsan"
4 9name = "xxx"
5 devops(edu = 666
8.简述你了解if条件语句的基本结构。
9.设定一个理想数字比如：66，让用户输入数字，如果比66大，则显示猜测的结果大了；如果比66小，则显示猜测的结果小了;只有等于66，显示猜测结果正确。

10.写程序，成绩有ABCDE5个等级，与分数的对应关系如下.
1 A    90-100
2 B    80-89
3 C    60-79
4 D    40-59
5 E    0-39
要求用户输入0-100的数字后，你能正确打印他的对应成绩.

11.模拟10086客服电话（条件语句的嵌套）

1.猜数字，设定一个理想数字比如：66，让用户输入数字，如果比66大，则显示猜测的结果大了；如果比66小，则显示猜测的结果小了;只有等于66，显示猜测结果正确，然后退出循环。
2.在上一题的基础，设置：给用户三次猜测机会，如果三次之内猜测对了，则显示猜测正确，退出循环，如果三次之内没有猜测正确，则自动退出循环，并显示‘大笨蛋’。
3.使用两种方法实现输出 1 2 3 4 5 6 8 9 10 。
4.求1-100的所有数的和
5.输出 1-100 内的所有奇数
6.输出 1-100 内的所有偶数
7.求1-2+3-4+5 … 99的所有数的和
8.⽤户登陆（三次输错机会）且每次输错误时显示剩余错误次数（提示：使⽤字符串格式化）
9.猜年龄游戏
要求：允许用户最多尝试3次，3次都没猜对的话，就直接退出，如果猜对了，打印恭喜信息并退出。

10.猜年龄游戏升级版
要求：允许用户最多尝试3次，每尝试3次后，如果还没猜对，就问用户是否还想继续玩，如果回答Y，就继续让其猜3次，以此往复，如果回答N，就退出程序，如何猜对了，就直接退出




